# BuiltInFailures.RefPlaneFailures Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..RefPlaneFailures Class
BuiltInFailures Class Members See Also
---
Failures about RefPlane.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static class RefPlaneFailures
```

Visual Basic
---
```text
Public NotInheritable Class RefPlaneFailures
```

Visual C++
---
```text
public ref class RefPlaneFailures abstract sealed
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..BuiltInFailures..::..RefPlaneFailures
# See Also
BuiltInFailures..::..RefPlaneFailures Members
Autodesk.Revit.DB Namespace